{
	"@metadata": {
		"authors": [
			"John Reid"
		]
	},
	"gwtoolset-no-accepted-types": "Nae acceptit types providit.",
	"gwtoolset-file-interpretation-error": "Thaur wis ae proablem processin the metadata file.",
	"gwtoolset-save-mapping-failed": "Sairrie. Thaur wis ae proablem processin yer request. Please gie it anither gae later. Mistak message: $1.",
	"gwtoolset-file-url-invalid": "The file disna yet exeest in the wiki. Ye first need tae uplaid the file fae yer computer gif ye want tae uise the file URL referance in the form.",
	"gwtoolset-mediafile-throttle-description": "Efter the batch luikower, in step 3, GWToolset uplaids the remainin records in yer batch uplaid bi wa o backgroond jobs. The mediafile throttle controls the nummer o mediafile requests that Wikimedia Commyns will mak again yer mediafile server ilka time ae backgroond job is rin. Ye can set the mediafile throttle til atween 1-20. Fer example, gif the total nummer o records in yer batch uplaid is 100 n you set the throttle til 20, Wikimedia Commyns will rin 5 backgroond jobs sae aes tae process yr entire batch uplaid. The time atween ilka backgroond uplaid job varies dependin oan server laid n confeeguration. We anteecipate that oan Wikimedia Commyns ae GWToolset backgroond job will rin at least ilka 5 minutes.",
	"gwtoolset-metadata-mapping-invalid-url": "The supplied metadata mapping URL disna match the expected mapping URL path.\n\n* Supplied URL: $1\n* Expected URL: $2",
	"gwtoolset-no-xml-element-found": "Naw XML element foond fer mappin.\n* Did ye enter ae value in the form fer \"{{int:gwtoolset-record-element-name}}\"?\n* Is the XML file weel-formed? Gie this ae gae [$1 XML valeedater].\n$2",
	"gwtoolset-page-title-contains-url": "The page \"$1\" contains the entire wiki URL. Mak sair that ye yinlie enter the page title, e.g. the pairt o the URL efter <code>/wiki/</code>.",
	"gwtoolset-step-1-instructions-2": "In this step, {{GENDER:$1|ye uplaid}} ae new metadata file til the wiki. The tuil will attempt tae extract the metadata fields available in the metadata file, that ye will then map til ae MediaWiki template in \"{{int:gwtoolset-step-2-heading}}\".",
	"gwtoolset-step-1-instructions-3": "Gif yer media file domain isna leeted ablo, please [$1 request] that yer media file domain be eikit til the Wikimedia Commons domain whiteleet. The domain whiteleet is ae leet o domains that Wikimedia Commons checks again afore fetchin media files. Gif yer media file domain isna oan that leet, Wikimedia Commons will na doonlaid media files fae that domain. The best example, tae haun in wi yer request, is aen actual airtin til ae media file.",
	"gwtoolset-categories": "Enter categeries separatit bi ae pipe chairacter (\"|\").",
	"gwtoolset-mapping-media-file-url-bad": "The media file URL coudna be evaluated. The URL delivers the content in ae waa that isna yet haunled bi this extension or thaur wis aen HTTP request issue. The URL gien wis \"$1\". HTTP request mistak \"$2\".",
	"gwtoolset-partner-explanation": "Pairtner templates ar pulled intil the soorce field o the MediaWiki template whan providit. Ye can fynd ae leet o nou pairtner templates in the categerie [[:Category:Source templates|soorce templates]]. Yince ye'v foond the pairtner template that ye wish tae uise pit the URL fer it in this field. Forby ye can cræft ae new pairtner template gif need be.",
	"gwtoolset-preview-unparsable-categories": "The follaein {{PLURAL:$1|categerie wis|categeries were}} no parsable. Mak siccar that the categerie template that ye'r referrin tae exeests in the wiki n parses properlie, or uise ae simpler categerie referance:",
	"gwtoolset-title-bad": "The title, that wis cræftit based oan the metadata n the MediaWiki template mappin, isna valid.\n\nTry anither field fae the metadata fer title n title-identifier, or gif possible, chynge the metadata whaur needed. See [https://commons.wikimedia.org/wiki/Commons:File_naming File naming] fer mair information.\n\n<strong>Onvalid title:</strong> $1.",
	"gwtoolset-verify-api-enabled": "The $1 extension needs the wiki API tae be enabled.\n\nPlease mak sair that <code>$wgEnableAPI</code> is set til <code>true</code>.",
	"gwtoolset-verify-api-writeable": "The $1 extension needs the wiki API tae be able tae perform write actions fer permittit uisers.\n\nPlease mak sair that <code>$wgEnableWriteAPI</code> is set til <code>true</code>.",
	"gwtoolset-reverse-creator-explanation": "Sometimes the creauter value is leetit aes \"faimilie name, gien name\" in the metadata. Checkin this kist will reverse that order n remuiv the comma, e.g., \"da Vinci, Leonardo\" wid become \"Leonardo da Vinci\". Mynd that this relies oan ae single comma in the value; gif thaur's nae comma in the value, nae chynge will be makit, n gif thaur's mair than yin comma, the chynge will yinlie be makit uisin the first comma.",
	"gwtoolset-wrap-creator-explanation": "The MediaWiki template micht hae aen <code>author</code>, <code>artist</code>, <code>publisher</code> or siclik boundin. Whan it dis, the metadata value mappit til it can autæmateeclie be wrappit in <code>{{Creator:<value>}}</code>.",
	"gwtoolset-wrap-language-explanation": "Sometimes ae metadata element micht contain ae <code>lang</code> attreebute. Whan it daes, the value can be wrappit in ae leid template, e.g. <code><dc:description lang=\"en\">A sentence written in English.</dc:description></code> wid become {{en|A sentence written in English.}}",
	"gwtoolset-global-license-explanation": "Or ye can speceefie ablow ae global license that will be applied tae aw the eetems in the batch uplaid. This value can be ae free text value or ae MediaWiki template. Gif this field haes ae value in it than onie metadata value mappit tae the permeession boundin will be ignored.",
	"gwtoolset-select-template": "Select ae template:",
	"gwtoolset-select-custom-template": "or enter ae custom template:",
	"gwtoolset-no-templatedata": "Thaur's nae <code>&lt;templatedata></code> block fer template $1.\n\nGif possible, eik ae $2 tae the template, or tae the template's $3.",
	"gwtoolset-templatedata-link-text": "<code>&lt;templatedata></code> block",
	"gwtoolset-templatebox-link-text": "<code>TemplateBox</code>"
}
